<!-- 6. *Написать функцию, которая вычисляет текущее время и возвращает его в формате с правильными склонениями, например:
22 часа 15 минут
21 час 43 минуты. -->

<?php



function getHours($h) {
    $hours = '';

    if($h>24)$h %= 24;

    if ($h === 1 || $h === 21) {
        $hours .= $h . " час";
    }
    elseif (($h >= 2 && $h <= 4) || ($h >= 22 && $h <= 24)) {
        $hours .= $h . " часа";
    }
    else {
        $hours .= $h . " часов";
    }

    return $hours;
}

function getMinutes($i) {
    $minutes = '';

    if (($i % 10 === 1) && ($i != 11)){
        $minutes .= $i . " минута";
    }
    elseif (($i % 10 >= 2) && ($i % 10 <= 4)) {
        $minutes .= $i . " минуты";
    }
    else {
        $minutes .= $i . " минут";
    }

    return $minutes;
}

function getSeconds($s) {
    $seconds = '';

    if (($s % 10 === 1) && ($s != 11)){
        $seconds .= $s . " секунда";
    }
    elseif (($s % 10 >= 2) && ($s % 10 <= 4)) {
        $seconds .= $s . " секунды";
    }
    else {
        $seconds .= $s . " секунд";
    }

    return $seconds;
}

function getCurrentTime($h, $i, $s) {
    return getHours($h) . getMinutes($i) . getSeconds($s);
}

echo "Новосибирское время: " . getCurrentTime(date("H") + 7, date(" i"), date(" s"));
echo "; ";
echo "Московское время: " . getCurrentTime(date("H") + 3, date(" i"), date(" s"));

// Seminar

<?php
/*
0 часов	минут	10 часов минут 20 часов минут	30 минут  40 минут
1 час	минута	11 часов минут 21 час	минута	31 минута 41 минута
2 часа	минуты	12 часов минут 22 часа	минуты	32 минуты 42 минуты
3 часа	минуты	13 часов минут 23 часа	минуты	33 минуты 43 минуты
4 часа	минуты	14 часов минут 24 часа	минуты	34 минуты 44 минуты
5 часов	минут	15 часов минут 25		минут	35 минут  45 минут
6 часов	минут	16 часов минут 26		минут	36 минут  46 минут 
7 часов минут	17 часов минут 27		минут	37 минут  47 минут
8 часов	минут	18 часов минут 28		минут	38 минут  48 минут 
9 часов минут	19 часов минут 29		минут	39 минут  49 минут
*/

for ($i = 0; $i <= 59; $i++)
    echo "$i " . get_word($i, "часов", "час", "часа") . "\n";

function get_word($number, $word1, $word2, $word3)
{
    if ($number > 10 && $number <= 20) return $word1;
    else {
        return match ($number % 10) {
            1 => $word2,
            2, 3, 4 => $word3,
            default => $word1,
        };
    }

}
